; domain
( DEFINE ( DOMAIN PEGSOLITAIRE-TEMPORAL )
( :REQUIREMENTS :ACTION-COSTS :CONDITIONAL-EFFECTS :TYPING )
( :TYPES
	LOCATION - OBJECT
)
( :PREDICATES
	( IN-LINE ?LOCATION0 - LOCATION ?LOCATION1 - LOCATION ?LOCATION2 - LOCATION )
	( OCCUPIED ?LOCATION0 - LOCATION )
	( FREE ?LOCATION0 - LOCATION )
	( EMPTYSTACK )
	( STACK1 )
	( STACK2 )
	( ACTIVE-JUMP ?LOCATION0 - LOCATION ?LOCATION1 - LOCATION ?LOCATION2 - LOCATION )
)
( :FUNCTIONS
	( TOTAL-COST )
)
( :ACTION START-JUMP
  :PARAMETERS ( ?LOCATION0 - LOCATION ?LOCATION1 - LOCATION ?LOCATION2 - LOCATION )
  :PRECONDITION
	( AND
		( OCCUPIED ?LOCATION0 )
		( OCCUPIED ?LOCATION1 )
		( FREE ?LOCATION2 )
		( IN-LINE ?LOCATION0 ?LOCATION1 ?LOCATION2 )
		( NOT ( ACTIVE-JUMP ?LOCATION0 ?LOCATION1 ?LOCATION2 ) )
		( NOT ( STACK2 ) )
	)
  :EFFECT
	( AND
		( NOT ( OCCUPIED ?LOCATION0 ) )
		( NOT ( OCCUPIED ?LOCATION1 ) )
		( NOT ( FREE ?LOCATION2 ) )
		( ACTIVE-JUMP ?LOCATION0 ?LOCATION1 ?LOCATION2 )
		( WHEN
			( EMPTYSTACK )
			( AND
				( NOT ( EMPTYSTACK ) )
				( STACK1 )
			)
		)
		( WHEN
			( STACK1 )
			( AND
				( NOT ( STACK1 ) )
				( STACK2 )
			)
		)
		( INCREASE ( TOTAL-COST ) 10000 )
	)
)
( :ACTION END-JUMP
  :PARAMETERS ( ?LOCATION0 - LOCATION ?LOCATION1 - LOCATION ?LOCATION2 - LOCATION )
  :PRECONDITION
	( AND
		( IN-LINE ?LOCATION0 ?LOCATION1 ?LOCATION2 )
		( ACTIVE-JUMP ?LOCATION0 ?LOCATION1 ?LOCATION2 )
	)
  :EFFECT
	( AND
		( FREE ?LOCATION0 )
		( FREE ?LOCATION1 )
		( OCCUPIED ?LOCATION2 )
		( NOT ( ACTIVE-JUMP ?LOCATION0 ?LOCATION1 ?LOCATION2 ) )
		( WHEN
			( STACK1 )
			( AND
				( NOT ( STACK1 ) )
				( EMPTYSTACK )
			)
		)
		( WHEN
			( STACK2 )
			( AND
				( NOT ( STACK2 ) )
				( STACK1 )
			)
		)
		( INCREASE ( TOTAL-COST ) 1 )
	)
)
)

; problem
( DEFINE ( PROBLEM PEGSOLITAIRE-SEQUENTIAL-036 )
( :DOMAIN PEGSOLITAIRE-TEMPORAL )
( :OBJECTS
	POS-0-0 POS-0-1 POS-0-2 POS-1-0 POS-1-1 POS-1-2 POS-2-0 POS-2-1 POS-2-2 - LOCATION
)
( :INIT
	( IN-LINE POS-0-0 POS-0-1 POS-0-2 )
	( IN-LINE POS-0-2 POS-0-1 POS-0-0 )
	( IN-LINE POS-1-0 POS-1-1 POS-1-2 )
	( IN-LINE POS-1-2 POS-1-1 POS-1-0 )
	( IN-LINE POS-2-0 POS-2-1 POS-2-2 )
	( IN-LINE POS-2-2 POS-2-1 POS-2-0 )
	( IN-LINE POS-0-0 POS-1-0 POS-2-0 )
	( IN-LINE POS-2-0 POS-1-0 POS-0-0 )
	( IN-LINE POS-0-1 POS-1-1 POS-2-1 )
	( IN-LINE POS-2-1 POS-1-1 POS-0-1 )
	( IN-LINE POS-0-2 POS-1-2 POS-2-2 )
	( IN-LINE POS-2-2 POS-1-2 POS-0-2 )
	( FREE POS-0-0 )
	( OCCUPIED POS-0-1 )
	( OCCUPIED POS-0-2 )
	( FREE POS-1-0 )
	( OCCUPIED POS-1-1 )
	( OCCUPIED POS-1-2 )
	( FREE POS-2-0 )
	( OCCUPIED POS-2-1 )
	( FREE POS-2-2 )
	( EMPTYSTACK )
	( = ( TOTAL-COST ) 0 )
)
( :GOAL
	( AND
		( FREE POS-0-0 )
		( FREE POS-0-1 )
		( FREE POS-0-2 )
		( FREE POS-1-0 )
		( FREE POS-1-1 )
		( FREE POS-1-2 )
		( FREE POS-2-1 )
		( FREE POS-2-0 )
		( EMPTYSTACK )
	)
)
( :METRIC MINIMIZE ( TOTAL-COST ) )
)

; plan
1. (start-jump pos-0-2 pos-1-2 pos-2-2)
   deleted: (occupied pos-0-2) (occupied pos-1-2) (free pos-2-2) (emptystack)
   added: (active-jump pos-0-2 pos-1-2 pos-2-2) (stack1)
   goals met: 3 of 9
2. (end-jump pos-0-2 pos-1-2 pos-2-2)
   deleted: (active-jump pos-0-2 pos-1-2 pos-2-2) (stack1)
   added: (free pos-0-2) (free pos-1-2) (occupied pos-2-2) (emptystack)
   goals met: 6 of 9
3. (start-jump pos-2-2 pos-2-1 pos-2-0)
   deleted: (occupied pos-2-2) (occupied pos-2-1) (free pos-2-0) (emptystack)
   added: (active-jump pos-2-2 pos-2-1 pos-2-0) (stack1)
   goals met: 4 of 9
4. (end-jump pos-2-2 pos-2-1 pos-2-0)
   deleted: (active-jump pos-2-2 pos-2-1 pos-2-0) (stack1)
   added: (free pos-2-2) (free pos-2-1) (occupied pos-2-0) (emptystack)
   goals met: 6 of 9
5. (start-jump pos-0-1 pos-1-1 pos-2-1)
   deleted: (occupied pos-0-1) (occupied pos-1-1) (free pos-2-1) (emptystack)
   added: (active-jump pos-0-1 pos-1-1 pos-2-1) (stack1)
   goals met: 4 of 9
6. (end-jump pos-0-1 pos-1-1 pos-2-1)
   deleted: (active-jump pos-0-1 pos-1-1 pos-2-1) (stack1)
   added: (free pos-0-1) (free pos-1-1) (occupied pos-2-1) (emptystack)
   goals met: 7 of 9
7. (start-jump pos-2-0 pos-2-1 pos-2-2)
   deleted: (occupied pos-2-0) (occupied pos-2-1) (free pos-2-2) (emptystack)
   added: (active-jump pos-2-0 pos-2-1 pos-2-2) (stack1)
   goals met: 6 of 9
8. (end-jump pos-2-0 pos-2-1 pos-2-2)
   deleted: (active-jump pos-2-0 pos-2-1 pos-2-2) (stack1)
   added: (free pos-2-0) (free pos-2-1) (occupied pos-2-2) (emptystack)
   goals met: 9 of 9
